export const Lngs = {
    AgreeNotice: "还未同意协议！",
    ShopTip1: "兑换成功！",
    ShopTip2: "兑换成功！礼物已放入您的背包",
    ShopTip3: "龙币不足！",
    ShopTip4: "瞄钻不足！",
    ShopTip5: "兑换成功！",
    ShopDes1: "今日累计兑换礼物价值",
    ShopDes2: "还差A可返利B",

    AddBetDes: "非备战阶段",

    One: "个",
    GetPlayerInfoErr: "获取玩家信息失败!",
    GetAccountInfoErr: "获取钱包信息失败!",
    GetChipCfgErr: "获取筹码配置信息失败！",
    GetRecordErr: "获取个人记录失败",
    GetResouleErr: "获取中奖结果失败",
    GodsRecord: "虚伪以待",

    // 商城返利文字
    ShopActive: `1.  活动开启期间，在兑换商城兑换礼物价值每到达一定金额，便可获得不同数量的龙币返利，兑换价值越高，返利越多；
 2.  每日均会发放次龙币返利，每次返利发放，均计算当日累计礼物兑换价值；
 3.  活动时间：A
 4.  最终解释权归官方所有。`,

    //玩法公告
    Notice: `本功能玩法不向未成年人开放，未成年人用户请勿参与。
1. 本平台玩法均为提升用户体验设计，任何用户和主播均不得利用平台玩法实施任何违法犯罪的行为或用于任何违法犯罪的用户；
2. 本平台玩法中获得的礼物和奖励仅限于在平台内消费，禁止房主、主持、用户及其他第三方主体进行任何形式的背包礼物交易；
3. 健康游戏，理性消费，如存在上述行为，平台将严格按照平台规则采取相关管理措施。`,
    Notice_Txt1: "我已阅读并同意",
    Notice_Txt2: "《玩法须知和公约》",
    Notice_Txt3: "今日不再弹出",
    //玩法须知和公约
    Agree: `1、通过概率获得的随机礼物仅限于在平台内消费，不得以任何形式兑换成法定货币、现金或其他任何具有交换价值的物品或服务，禁止主播、主播所在公会、用户及其他第三方主体进行任何形式的礼物交易，否则平台将严格按照平台规则对相关用户采取相关管理措施，用户应自行对此承担法律责任及相关损失。请用户谨防上当受骗。
2、本功能玩法不向未成年人开放，未成年人用户请勿参与，平台将通过大数据和实名认证等方式实时跟踪，确保此功能不会被未成年人使用。直播间内主播、主播所在公会以及房间其他用户禁止引导未成年人用户参与本功能玩法，引导未成年人参与本功能玩法将受到平台严厉打击和处罚。
3、概率礼物是提升房间内互动体验的功能，仅供娱乐交流使用。直播间内主播、主播所在公会以及其他任何主体均不得以任何非法目的与方式（包括但不限于赌博、诈骗等）对其进行使用。
4、禁止使用概率礼物玩法实施任何影响互动公平性的行为，或利用产品BUG等不正当手法参与互动，一旦发生上述情况，平台有权取消发放对应奖励，追回奖励，对情节严重的，平台保留一切追究法律责任的权利。
5、用户不得以任何不正当手段或舞弊方式参与本功能玩法，一经发现，平台有权取消用户的参与资格，并有权收回用户获得的礼物及权益，同时保留追究其相关法律责任的权利。不正当手段及舞弊行为包括但不限于：下载非官方客户端、使用插件、外挂等非法工具扫码、下载、安装、注册、登录、使用；篡改设备数据；恶意牟利等扰乱平台秩序；使用插件、外挂系统或第三方工具对本平台及本活动进行干扰、破坏、修改或施加其他影响及平台认为的其他不正当手段。
6、因用户操作不当或用户所在区域网络故障、支付平台网络故障、电信运营商故障、第三方其他平台限制等非平台所能控制的原因导致的用户无法参与活动、或参与失败，平台无需为此承担任何法律责任。
7、平台可能在房间、功能页展示用户账号信息及所获得的随机礼物等信息，您授权并同意平台为此使用并展示您的公开账号信息（如头像、昵称等）及所获得的随机礼物等信息。
8、平台依法运营此功能玩法，如因不可抗力、情势变更，相关政策变动、政府机关指令要求等原因导致本功能玩法调整、暂停举办或无法进行的，平台有权随时决定修改、暂停、取消或终止本功能玩法，并无需为此承担任何法律责任。`
};
